---
title: "주소부여, ip route 명령어 사용"

category: L3.IPv4.Routing
tags:
 - [EVE]


toc: true
toc_sticky: true

date: 2022-12-07
last_modified_at: 2022-12-07

#img: ":aws 1.png"

---

<!-- outline-start -->



### Ex01. Router 4개, 리눅스 4개를 서로 연결해보자.


![1](https://user-images.githubusercontent.com/117553252/211179350-a901a0bb-794d-4af1-b361-b31ecde440d6.png)




1. EVE에서 라우터 4개랑 리눅스 4개를 만든다.
  - Router 설정은 Node > Cisco IOL > Number: 4, Serial: 1.
  - Linux 설정은 Node > Linux > Number: 4, Image: linux-5, RAM: 2048.

1. 장치들을 연결하기.
  - 모든 장치 드래그 > 오른쪽 마우스 > Start Selected

1. 라우터에 주소 부여하기.

ex. Router 1

  ```yaml

     > enable
     # conf t

     (config)# interface e0/0
     (config-if)# ip address 192.168.10.2 255.255.255.0
     (config-if)# no shutdown
     (config-if)# exit

     (config)# interface s1/0
     (config-if)# ip address 1.1.1.1 255.0.0.0
     (config-if)# no shutdown
     (config-if)# end

     # show ip int brief

   ```




1. 리눅스에 주소 부여하기.



ex. Linux5

  ```yaml

      # cd /etc/sysconfig/network-scripts
      # ls
      # vi ifcfg-eth0
      dhcp를 static으로 수정하고 아래 3줄은 추가하기.
      IPADDR=192.168.10.1
      NETMASK=255.255.255.0
      GATEWAY=192.168.10.2
      중립상태(ESC 누르기) -> 저장 후 vi 종료 (:wq 입력)

      # ifdown eth0
      # ifup eth0
      # ifconfig
      # netstat -rn

   ```




1. 라우터에 지도 만들어주기.


![2](https://user-images.githubusercontent.com/117553252/211179386-8710c3a8-1872-4413-b780-1c761ccb697f.png)



ex. Router1) 직접 물리적으로 연결 된 네트워크는 2개이기 때문에 5개의 지도를 만들어 줘야 함.

  ```yaml

    > enable
    # conf t
    (config)# ip route 2.0.0.0 255.0.0.0 1.1.1.2
    (config)# ip route 3.0.0.0 255.0.0.0 1.1.1.2
    (config)# ip route 192.168.20.0 255.255.255.0 1.1.1.2
    (config)# ip route 192.168.30.0 255.255.255.0 1.1.1.2
    (config)# ip route 192.168.40.0. 255.255.255.0 1.1.1.2

   ```




1. 연결이 잘 되었는지 ping으로 확인하기.


ex. Linux 5에서 ping으로 모든 IP 주소를 쳐 보자.
     모두가 연결이 된다면 모두가 잘 연결 되었다는 뜻임!


![3](https://user-images.githubusercontent.com/117553252/211179396-785fb406-a638-491d-a7ff-a452892be099.png)





### Ex02. Router 4개, 리눅스 4개를 서로 연결해보자.


![4](https://user-images.githubusercontent.com/117553252/211179403-eb98e28c-7dc5-4bb4-90e1-713ad47f00cb.png)



1. EVE에서 라우터 4개랑 리눅스 4개를 만든다.
 - Router 설정은 Node > Cisco IOL > Number: 4, Serial: 1.
 - Linux 설정은 Node > Linux > Number: 4, Image: linux-5, RAM: 2048.

1. 장치들을 연결하기.
 - 모든 장치 드래그 > 오른쪽 마우스 > Start Selected

1. 라우터에 주소 부여하기.

 ex. Router 1

  ```yaml

    > enable
    # conf t

    (config)# interface e0/0
    (config-if)# ip address 192.168.10.2 255.255.255.0
    (config-if)# no shutdown
    (config-if)# exit

    (config)# interface s1/0
    (config-if)# ip address 1.1.1.1 255.0.0.0
    (config-if)# no shutdown
    (config-if)# end

    # show ip int brief

   ```

1. 리눅스에 주소 부여하기.

  ex. Linux5

   ```yaml

     # cd /etc/sysconfig/network-scripts
     # ls
     # vi ifcfg-eth0
     dhcp를 static으로 수정하고 아래 3줄은 추가하기.
     IPADDR=192.168.10.1
     NETMASK=255.255.255.0
     GATEWAY=192.168.10.2
     중립상태(ESC 누르기) -> 저장 후 vi 종료 (:wq 입력)

     # ifdown eth0
     # ifup eth0
     # ifconfig
     # netstat -rn

   ```

1. 라우터에 지도 만들어주기.

  ex. Router1) 직접 물리적으로 연결 된 네트워크는 2개이기 때문에 5개의 지도를 만들어 줘야 함.

    ```yaml

     > enable
     # conf t
     (config)# ip route 126.0.0.0 255.0.0.0 1.1.1.2
     (config)# ip route 191.255.0.0 255.255.0.0 1.1.1.2
     (config)# ip route 2.0.0.0 255.0.0.0 1.1.1.2
     (config)# ip route 3.0.0.0 255.0.0.0 1.1.1.2
     (config)# ip route 223.255.255.0 255.255.255.0 1.1.1.2

     ```






1. 연결이 잘 되었는지 ping으로 확인하기.

ex. Linux 5에서 ping으로 모든 IP 주소를 쳐 보자.
    모두가 연결이 된다면 모두가 잘 연결 되었다는 뜻임!




### 라우터에서 ip route 확인하기.


```yaml

        > enable
        # show ip route

```

또는

```yaml

    > enable
    # conf t
    (config)# do show ip route

```



- C : 물리적으로 직접 붙어 있는 것.
- L : 자신의 라우터 주소를 확인할 대 쓰는 것.
- S : 수동으로 직접 지도 만들어 준 것.

ex.
![3](https://user-images.githubusercontent.com/117553252/211134885-1c52c464-b1be-4d91-a0d5-25c9c0a4bd7d.png)




### 참고.

PC, Router 둘 중에 어느 것을 먼저 주소를 부여하든지 상관 없음.
단, 주소가 정확하게 들어가야 함. (주소 주는 것이 제일 중요)
여기서 오타가 나게 되면 찾기가 힘들기 때문에 주의하자.

한쪽에만 ping으로 다 연결이 된다면 다 연결이 되었다는 뜻.






### no ip route - ip route 삭제하기


- ip route 삭제하는 방법
```yaml
ex.
  no ip route 2.0.0.0 255.0.0.0 1.1.1.2
  no ip route 3.0.0.0 255.0.0.0 1.1.1.2
  no ip route 126.0.0.0 255.0.0.0 1.1.1.2
  no ip route 191.255.0.0 255.255.0.0 1.1.1.2
  no ip route 223.255.255.0 255.255.255.0 1.1.1.2
```
![5](https://user-images.githubusercontent.com/117553252/211134993-2dca573c-457c-40bb-97f0-af9c5ee33175.png)



