---
title: "VLAN"

tags:
 - [VLAN]

category: L2&L3.Switch
toc: true
toc_sticky: true

date: 2023-02-13
last_modified_at: 2023-02-13

#img: ":aws 1.png"

---

<!-- outline-start -->


### VLAN<br/>
: Virtual Local Network - 논리적으로 Vroadcast 영역<br/>
참고) 물리적인 Broadcast 영역 (L3 장비)<br/><br/>


### Ex. VLAN<br/>

사진첨부
<br/><br/>

부서별 연락이 되게 해 보자.<br/><br/>

```yaml
Access mode : PC끼리 연결 된 것.
Trunk mode : Switch끼리 연결 된 것.
```
<br/><br/>

#### 방법<br/>

- Switch 1<br/>
```yaml
vlan 10

vlan 20

int fa0/1
switchport mode access
switchport access vlan 10

int fa0/2
switchport mode access
switchport access vlan 20

int fa0/3
switchport mode trunk

show vlan
```
<br/><br/>

- Switch 2<br/>
```yaml
vlan 10

vlan 20

int fa0/1
switchport mode access
switchport access vlan 10

int fa0/2
switchport mode access
switchport access vlan 20

int fa0/3
switchport mode trunk

show vlan
```
<br/><br/>


#### 결과<br/>


사진첨부
<br/><br/>

사진첨부
<br/><br/>

사진첨부
<br/><br/>

사진첨부
<br/><br/>

PC 10.1<br/>
사진첨부
<br/><br/>
10.2는 통신이 안 되지만<br/>
10.3은 통신이 가능하다.<br/><br/>

사진첨부
<br/><br/>
10.4 역시 통신이 안 된다.<br/><br/>

#### 정리 - 결과<br/>

- PC 10.1<br/>
```yaml
> ping 192.168.10.2 - X
> ping 192.168.10.3 - O
> ping 192.168.10.4 - X
```
<br/><br/>

- PC 10.2<br/>
```yaml
> ping 192.168.10.1 - X
> ping 192.168.10.3 - X
> ping 192.168.10.4 - O
```
<br/><br/>


- PC 10.3<br/>
```yaml
> ping 192.168.10.1 - O
> ping 192.168.10.2 - X
> ping 192.168.10.4 - X
```
<br/><br/>


- PC 10.4<br/>
```yaml
> ping 192.168.10.1 - X
> ping 192.168.10.2 - O
> ping 192.168.10.3 - X
```
<br/><br/>


### 주의<br/>
- 스위치는 VLAN 구성이 되어 있는 경우<br/>
받을 때 VLAN Tag를 붙이고, 나갈 때 VLAN Tag를 제거함.<br/>
단, Trunk mode인 경우는 VLAN Tag 붙은 상태로 보내고 받음.<br/><br/><br/>


### 참고<br/>

사진첨부
<br/><br/>

기본으로 VLAN 1에 다 설정되어 있다.<br/><br/>


### Ex.02<br/>

사진첨부
<br/><br/>

- L3<br/>
```yaml
interface fa0/0
no shutdown

interface fa0/0.10
encapsulation dot1Q 10
ip address 192.168.10.254 255.255.255.0

interface fa0/0.20
encapsulation dot1Q 20
ip address 192.168.20.254 255.255.255.0
```
<br/><br/>

- Switch 02<br/>
```yaml
interface fa0/4
switchport mode trunk
```
<br/><br/>

#### 결과<br/>

사진첨부
<br/><br/>

- PC 10.1<br/>
```yaml
> ping 192.168.10.2 - O
> ping 192.168.20.1 - O
> ping 192.168.20.2 - O
```
<br/><br/>

사진첨부
<br/><br/>

사진첨부
<br/><br/>

### Ex. 03<br/>

사진첨부
<br/><br/>

10.1에서 모든 PC로 ping이 가도록.<br/>

#### 방법<br/>

- Switch 01<br/>
```yaml
interface fa0/3
switchport trunk encapsulation dot1q
switchport mode trunk
```
<br/><br/>

- Switch 02<br/>
```yaml
interface fa0/3
switchport trunk encapsulation dot1q
switchport mode trunk
```
<br/><br/>

- Router 01<br/>
```yaml
int fa0/0
no shutdown
```
<br/><br/>

- Router 02<br/>
```yaml
int fa0/0
no shutdown
```
<br/><br/>

#### 결과<br/>

사진첨부
<br/><br/>

사진첨부
<br/><br/>

PC 10.1에서 모두 ping이 된다.<br/><br/><br/>


### Ex. 04<br/>

사진첨부
<br/><br/>

#### 방법<br/>

- Switch 3<br/>
```yaml
no ip routing

vlan 10

vlan 20

int Gi0/0
switchport trunk encapsulation dot1q
switchport mode trunk

int Gi0/1
switchport mode access
switchport access vlan 10

int Gi0/2
switchport mode access
switchport access vlan 20
```
<br/><br/>

- Switch 4<br/>
```yaml
no ip routing

vlan 30

vlan 40

int Gi0/0
switchport trunk encapsulation dot1q
switchport mode trunk

int Gi0/1
switchport mode access
switchport access vlan 30

int Gi0/2
switchport mode access
swtichport access vlan 40
```

<br/><br/>

- vIOS1
```yaml
int Gi0/0
no shutdown

int g0/0.10
encapsulation dot1Q 10
ip address 192.168.10.2 255.255.255.0

int g0/0.20
encapsulation dot1Q 20
ip address 192.168.20.2 255.255.255.0
```

<br/><br/>

- vIOS2<br/>
```yaml
int Gi0/0
no shutdown

int g0/0.30
encapsulation dot1Q 30
ip address 192.168.30.2 255.255.255.0

int g0/0.40
encapsulation dot1Q 40
ip address 192.168.40.2 255.255.255.0
```
<br/><br/><br/>


#### 결과<br/>

사진첨부
<br/><br/>

10.1 PC에서 모두 다 ping이 간다.<br/><br/><br/>



#### 참고<br/>

Linux - cd /etc/sysconfig/network-scripts/<br/>
vi ifcfg-eth0<br/><br/>
